espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SPI_MEM_S_CMD_REG register
 *  SPI0 FSM status register
 */
#define SPI_MEM_S_CMD_REG (DR_REG_PSRAM_MSPI0_BASE + 0x0)
/** SPI_MEM_S_MST_ST : RO; bitpos: [3:0]; default: 0;
 *  The current status of SPI0 master FSM: spi0_mst_st. 0: idle state, 1:SPI0_GRANT ,
 *  2: program/erase suspend state, 3: SPI0 read data state, 4: wait cache/EDMA sent
 *  data is stored in SPI0 TX FIFO, 5: SPI0 write data state.
 */
#define SPI_MEM_S_MST_ST    0x0000000FU
#define SPI_MEM_S_MST_ST_M  (SPI_MEM_S_MST_ST_V << SPI_MEM_S_MST_ST_S)
#define SPI_MEM_S_MST_ST_V  0x0000000FU
#define SPI_MEM_S_MST_ST_S  0
/** SPI_MEM_S_SLV_ST : RO; bitpos: [7:4]; default: 0;
 *  The current status of SPI0 slave FSM: mspi_st. 0: idle state, 1: preparation state,
 *  2: send command state, 3: send address state, 4: wait state, 5: read data state,
 *  6:write data state, 7: done state, 8: read data end state.
 */
#define SPI_MEM_S_SLV_ST    0x0000000FU
#define SPI_MEM_S_SLV_ST_M  (SPI_MEM_S_SLV_ST_V << SPI_MEM_S_SLV_ST_S)
#define SPI_MEM_S_SLV_ST_V  0x0000000FU
#define SPI_MEM_S_SLV_ST_S  4
/** SPI_MEM_S_USR : HRO; bitpos: [18]; default: 0;
 *  SPI0 USR_CMD start bit, only used when SPI_MEM_S_AXI_REQ_EN is cleared.  An operation
 *  will be triggered when the bit is set. The bit will be cleared once the operation
 *  done.1: enable 0: disable.
 */
#define SPI_MEM_S_USR    (BIT(18))
#define SPI_MEM_S_USR_M  (SPI_MEM_S_USR_V << SPI_MEM_S_USR_S)
#define SPI_MEM_S_USR_V  0x00000001U
#define SPI_MEM_S_USR_S  18

/** SPI_MEM_S_CTRL_REG register
 *  SPI0 control register.
 */
#define SPI_MEM_S_CTRL_REG (DR_REG_PSRAM_MSPI0_BASE + 0x8)
/** SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT : R/W; bitpos: [0]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to flash, the level
 *  of SPI_DQS is output by the MSPI controller.
 */
#define SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT    (BIT(0))
#define SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT_M  (SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT_V << SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT_S)
#define SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_S_WDUMMY_DQS_ALWAYS_OUT_S  0
/** SPI_MEM_S_WDUMMY_ALWAYS_OUT : R/W; bitpos: [1]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to flash, the level
 *  of SPI_IO[7:0] is output by the MSPI controller.
 */
#define SPI_MEM_S_WDUMMY_ALWAYS_OUT    (BIT(1))
#define SPI_MEM_S_WDUMMY_ALWAYS_OUT_M  (SPI_MEM_S_WDUMMY_ALWAYS_OUT_V << SPI_MEM_S_WDUMMY_ALWAYS_OUT_S)
#define SPI_MEM_S_WDUMMY_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_S_WDUMMY_ALWAYS_OUT_S  1
/** SPI_MEM_S_FDUMMY_RIN : R/W; bitpos: [2]; default: 1;
 *  In an MSPI read data transfer when accesses to flash, the level of SPI_IO[7:0] is
 *  output by the MSPI controller in the first half part of dummy phase. It is used to
 *  mask invalid SPI_DQS in the half part of dummy phase.
 */
#define SPI_MEM_S_FDUMMY_RIN    (BIT(2))
#define SPI_MEM_S_FDUMMY_RIN_M  (SPI_MEM_S_FDUMMY_RIN_V << SPI_MEM_S_FDUMMY_RIN_S)
#define SPI_MEM_S_FDUMMY_RIN_V  0x00000001U
#define SPI_MEM_S_FDUMMY_RIN_S  2
/** SPI_MEM_S_FDUMMY_WOUT : R/W; bitpos: [3]; default: 1;
 *  In an MSPI write data transfer when accesses to flash, the level of SPI_IO[7:0] is
 *  output by the MSPI controller in the second half part of dummy phase. It is used to
 *  pre-drive flash.
 */
#define SPI_MEM_S_FDUMMY_WOUT    (BIT(3))
#define SPI_MEM_S_FDUMMY_WOUT_M  (SPI_MEM_S_FDUMMY_WOUT_V << SPI_MEM_S_FDUMMY_WOUT_S)
#define SPI_MEM_S_FDUMMY_WOUT_V  0x00000001U
#define SPI_MEM_S_FDUMMY_WOUT_S  3
/** SPI_MEM_S_FDOUT_OCT : R/W; bitpos: [4]; default: 0;
 *  Apply 8 signals during write-data phase 1:enable 0: disable
 */
#define SPI_MEM_S_FDOUT_OCT    (BIT(4))
#define SPI_MEM_S_FDOUT_OCT_M  (SPI_MEM_S_FDOUT_OCT_V << SPI_MEM_S_FDOUT_OCT_S)
#define SPI_MEM_S_FDOUT_OCT_V  0x00000001U
#define SPI_MEM_S_FDOUT_OCT_S  4
/** SPI_MEM_S_FDIN_OCT : R/W; bitpos: [5]; default: 0;
 *  Apply 8 signals during read-data phase 1:enable 0: disable
 */
#define SPI_MEM_S_FDIN_OCT    (BIT(5))
#define SPI_MEM_S_FDIN_OCT_M  (SPI_MEM_S_FDIN_OCT_V << SPI_MEM_S_FDIN_OCT_S)
#define SPI_MEM_S_FDIN_OCT_V  0x00000001U
#define SPI_MEM_S_FDIN_OCT_S  5
/** SPI_MEM_S_FADDR_OCT : R/W; bitpos: [6]; default: 0;
 *  Apply 8 signals during address phase 1:enable 0: disable
 */
#define SPI_MEM_S_FADDR_OCT    (BIT(6))
#define SPI_MEM_S_FADDR_OCT_M  (SPI_MEM_S_FADDR_OCT_V << SPI_MEM_S_FADDR_OCT_S)
#define SPI_MEM_S_FADDR_OCT_V  0x00000001U
#define SPI_MEM_S_FADDR_OCT_S  6
/** SPI_MEM_S_FCMD_QUAD : R/W; bitpos: [8]; default: 0;
 *  Apply 4 signals during command phase 1:enable 0: disable
 */
#define SPI_MEM_S_FCMD_QUAD    (BIT(8))
#define SPI_MEM_S_FCMD_QUAD_M  (SPI_MEM_S_FCMD_QUAD_V << SPI_MEM_S_FCMD_QUAD_S)
#define SPI_MEM_S_FCMD_QUAD_V  0x00000001U
#define SPI_MEM_S_FCMD_QUAD_S  8
/** SPI_MEM_S_FCMD_OCT : R/W; bitpos: [9]; default: 0;
 *  Apply 8 signals during command phase 1:enable 0: disable
 */
#define SPI_MEM_S_FCMD_OCT    (BIT(9))
#define SPI_MEM_S_FCMD_OCT_M  (SPI_MEM_S_FCMD_OCT_V << SPI_MEM_S_FCMD_OCT_S)
#define SPI_MEM_S_FCMD_OCT_V  0x00000001U
#define SPI_MEM_S_FCMD_OCT_S  9
/** SPI_MEM_S_FASTRD_MODE : R/W; bitpos: [13]; default: 1;
 *  This bit enable the bits: SPI_MEM_S_FREAD_QIO, SPI_MEM_S_FREAD_DIO, SPI_MEM_S_FREAD_QOUT
 *  and SPI_MEM_S_FREAD_DOUT. 1: enable 0: disable.
 */
#define SPI_MEM_S_FASTRD_MODE    (BIT(13))
#define SPI_MEM_S_FASTRD_MODE_M  (SPI_MEM_S_FASTRD_MODE_V << SPI_MEM_S_FASTRD_MODE_S)
#define SPI_MEM_S_FASTRD_MODE_V  0x00000001U
#define SPI_MEM_S_FASTRD_MODE_S  13
/** SPI_MEM_S_FREAD_DUAL : R/W; bitpos: [14]; default: 0;
 *  In the read operations, read-data phase apply 2 signals. 1: enable 0: disable.
 */
#define SPI_MEM_S_FREAD_DUAL    (BIT(14))
#define SPI_MEM_S_FREAD_DUAL_M  (SPI_MEM_S_FREAD_DUAL_V << SPI_MEM_S_FREAD_DUAL_S)
#define SPI_MEM_S_FREAD_DUAL_V  0x00000001U
#define SPI_MEM_S_FREAD_DUAL_S  14
/** SPI_MEM_S_Q_POL : R/W; bitpos: [18]; default: 1;
 *  The bit is used to set MISO line polarity, 1: high 0, low
 */
#define SPI_MEM_S_Q_POL    (BIT(18))
#define SPI_MEM_S_Q_POL_M  (SPI_MEM_S_Q_POL_V << SPI_MEM_S_Q_POL_S)
#define SPI_MEM_S_Q_POL_V  0x00000001U
#define SPI_MEM_S_Q_POL_S  18
/** SPI_MEM_S_D_POL : R/W; bitpos: [19]; default: 1;
 *  The bit is used to set MOSI line polarity, 1: high 0, low
 */
#define SPI_MEM_S_D_POL    (BIT(19))
#define SPI_MEM_S_D_POL_M  (SPI_MEM_S_D_POL_V << SPI_MEM_S_D_POL_S)
#define SPI_MEM_S_D_POL_V  0x00000001U
#define SPI_MEM_S_D_POL_S  19
/** SPI_MEM_S_FREAD_QUAD : R/W; bitpos: [20]; default: 0;
 *  In the read operations read-data phase apply 4 signals. 1: enable 0: disable.
 */
#define SPI_MEM_S_FREAD_QUAD    (BIT(20))
#define SPI_MEM_S_FREAD_QUAD_M  (SPI_MEM_S_FREAD_QUAD_V << SPI_MEM_S_FREAD_QUAD_S)
#define SPI_MEM_S_FREAD_QUAD_V  0x00000001U
#define SPI_MEM_S_FREAD_QUAD_S  20
/** SPI_MEM_S_WP_REG : R/W; bitpos: [21]; default: 1;
 *  Write protect signal output when SPI is idle.  1: output high, 0: output low.
 */
#define SPI_MEM_S_WP_REG    (BIT(21))
#define SPI_MEM_S_WP_REG_M  (SPI_MEM_S_WP_REG_V << SPI_MEM_S_WP_REG_S)
#define SPI_MEM_S_WP_REG_V  0x00000001U
#define SPI_MEM_S_WP_REG_S  21
/** SPI_MEM_S_FREAD_DIO : R/W; bitpos: [23]; default: 0;
 *  In the read operations address phase and read-data phase apply 2 signals. 1: enable
 *  0: disable.
 */
#define SPI_MEM_S_FREAD_DIO    (BIT(23))
#define SPI_MEM_S_FREAD_DIO_M  (SPI_MEM_S_FREAD_DIO_V << SPI_MEM_S_FREAD_DIO_S)
#define SPI_MEM_S_FREAD_DIO_V  0x00000001U
#define SPI_MEM_S_FREAD_DIO_S  23
/** SPI_MEM_S_FREAD_QIO : R/W; bitpos: [24]; default: 0;
 *  In the read operations address phase and read-data phase apply 4 signals. 1: enable
 *  0: disable.
 */
#define SPI_MEM_S_FREAD_QIO    (BIT(24))
#define SPI_MEM_S_FREAD_QIO_M  (SPI_MEM_S_FREAD_QIO_V << SPI_MEM_S_FREAD_QIO_S)
#define SPI_MEM_S_FREAD_QIO_V  0x00000001U
#define SPI_MEM_S_FREAD_QIO_S  24
/** SPI_MEM_S_DQS_IE_ALWAYS_ON : R/W; bitpos: [30]; default: 0;
 *  When accesses to flash, 1: the IE signals of pads connected to SPI_DQS are always
 *  1. 0: Others.
 */
#define SPI_MEM_S_DQS_IE_ALWAYS_ON    (BIT(30))
#define SPI_MEM_S_DQS_IE_ALWAYS_ON_M  (SPI_MEM_S_DQS_IE_ALWAYS_ON_V << SPI_MEM_S_DQS_IE_ALWAYS_ON_S)
#define SPI_MEM_S_DQS_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_S_DQS_IE_ALWAYS_ON_S  30
/** SPI_MEM_S_DATA_IE_ALWAYS_ON : R/W; bitpos: [31]; default: 1;
 *  When accesses to flash, 1: the IE signals of pads connected to SPI_IO[7:0] are
 *  always 1. 0: Others.
 */
#define SPI_MEM_S_DATA_IE_ALWAYS_ON    (BIT(31))
#define SPI_MEM_S_DATA_IE_ALWAYS_ON_M  (SPI_MEM_S_DATA_IE_ALWAYS_ON_V << SPI_MEM_S_DATA_IE_ALWAYS_ON_S)
#define SPI_MEM_S_DATA_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_S_DATA_IE_ALWAYS_ON_S  31

