espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_FMEM_S_PMS1_ATTR_REG register
 *  SPI1 flash PMS section 1 attribute register
 */
#define SPI_FMEM_S_PMS1_ATTR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x104)
/** SPI_FMEM_S_PMS1_RD_ATTR : R/W; bitpos: [0]; default: 1;
 *  1: SPI1 flash PMS section 1 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS1_RD_ATTR    (BIT(0))
#define SPI_FMEM_S_PMS1_RD_ATTR_M  (SPI_FMEM_S_PMS1_RD_ATTR_V << SPI_FMEM_S_PMS1_RD_ATTR_S)
#define SPI_FMEM_S_PMS1_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS1_RD_ATTR_S  0
/** SPI_FMEM_S_PMS1_WR_ATTR : R/W; bitpos: [1]; default: 1;
 *  1: SPI1 flash PMS section 1 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS1_WR_ATTR    (BIT(1))
#define SPI_FMEM_S_PMS1_WR_ATTR_M  (SPI_FMEM_S_PMS1_WR_ATTR_V << SPI_FMEM_S_PMS1_WR_ATTR_S)
#define SPI_FMEM_S_PMS1_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS1_WR_ATTR_S  1
/** SPI_FMEM_S_PMS1_ECC : R/W; bitpos: [2]; default: 0;
 *  SPI1 flash PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS
 *  section 1 is configured by registers SPI_FMEM_S_PMS1_ADDR_REG and
 *  SPI_FMEM_S_PMS1_SIZE_REG.
 */
#define SPI_FMEM_S_PMS1_ECC    (BIT(2))
#define SPI_FMEM_S_PMS1_ECC_M  (SPI_FMEM_S_PMS1_ECC_V << SPI_FMEM_S_PMS1_ECC_S)
#define SPI_FMEM_S_PMS1_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS1_ECC_S  2
/** SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR : R/W; bitpos: [3]; default: 1;
 *  1: SPI1 flash  non-secure PMS section 1 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR    (BIT(3))
#define SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR_M  (SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR_V << SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR_S)
#define SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS1_NONSECURE_RD_ATTR_S  3
/** SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR : R/W; bitpos: [4]; default: 1;
 *  1: SPI1 flash non-secure PMS section 1 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR    (BIT(4))
#define SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR_M  (SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR_V << SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR_S)
#define SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS1_NONSECURE_WR_ATTR_S  4
/** SPI_FMEM_S_PMS1_NONSECURE_ECC : R/W; bitpos: [5]; default: 0;
 *  SPI1 flash non-secure PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it.
 *  The flash PMS section 1 is configured by registers SPI_FMEM_S_PMS1_ADDR_REG and
 *  SPI_FMEM_S_PMS1_SIZE_REG.
 */
#define SPI_FMEM_S_PMS1_NONSECURE_ECC    (BIT(5))
#define SPI_FMEM_S_PMS1_NONSECURE_ECC_M  (SPI_FMEM_S_PMS1_NONSECURE_ECC_V << SPI_FMEM_S_PMS1_NONSECURE_ECC_S)
#define SPI_FMEM_S_PMS1_NONSECURE_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS1_NONSECURE_ECC_S  5

/** SPI_FMEM_S_PMS2_ATTR_REG register
 *  SPI1 flash PMS section 2 attribute register
 */
#define SPI_FMEM_S_PMS2_ATTR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x108)
/** SPI_FMEM_S_PMS2_RD_ATTR : R/W; bitpos: [0]; default: 1;
 *  1: SPI1 flash PMS section 2 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS2_RD_ATTR    (BIT(0))
#define SPI_FMEM_S_PMS2_RD_ATTR_M  (SPI_FMEM_S_PMS2_RD_ATTR_V << SPI_FMEM_S_PMS2_RD_ATTR_S)
#define SPI_FMEM_S_PMS2_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS2_RD_ATTR_S  0
/** SPI_FMEM_S_PMS2_WR_ATTR : R/W; bitpos: [1]; default: 1;
 *  1: SPI1 flash PMS section 2 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS2_WR_ATTR    (BIT(1))
#define SPI_FMEM_S_PMS2_WR_ATTR_M  (SPI_FMEM_S_PMS2_WR_ATTR_V << SPI_FMEM_S_PMS2_WR_ATTR_S)
#define SPI_FMEM_S_PMS2_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS2_WR_ATTR_S  1
/** SPI_FMEM_S_PMS2_ECC : R/W; bitpos: [2]; default: 0;
 *  SPI1 flash PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS
 *  section 2 is configured by registers SPI_FMEM_S_PMS2_ADDR_REG and
 *  SPI_FMEM_S_PMS2_SIZE_REG.
 */
#define SPI_FMEM_S_PMS2_ECC    (BIT(2))
#define SPI_FMEM_S_PMS2_ECC_M  (SPI_FMEM_S_PMS2_ECC_V << SPI_FMEM_S_PMS2_ECC_S)
#define SPI_FMEM_S_PMS2_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS2_ECC_S  2
/** SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR : R/W; bitpos: [3]; default: 1;
 *  1: SPI1 flash  non-secure PMS section 2 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR    (BIT(3))
#define SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR_M  (SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR_V << SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR_S)
#define SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS2_NONSECURE_RD_ATTR_S  3
/** SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR : R/W; bitpos: [4]; default: 1;
 *  1: SPI1 flash non-secure PMS section 2 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR    (BIT(4))
#define SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR_M  (SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR_V << SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR_S)
#define SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS2_NONSECURE_WR_ATTR_S  4
/** SPI_FMEM_S_PMS2_NONSECURE_ECC : R/W; bitpos: [5]; default: 0;
 *  SPI1 flash non-secure PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it.
 *  The flash PMS section 2 is configured by registers SPI_FMEM_S_PMS2_ADDR_REG and
 *  SPI_FMEM_S_PMS2_SIZE_REG.
 */
#define SPI_FMEM_S_PMS2_NONSECURE_ECC    (BIT(5))
#define SPI_FMEM_S_PMS2_NONSECURE_ECC_M  (SPI_FMEM_S_PMS2_NONSECURE_ECC_V << SPI_FMEM_S_PMS2_NONSECURE_ECC_S)
#define SPI_FMEM_S_PMS2_NONSECURE_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS2_NONSECURE_ECC_S  5

/** SPI_FMEM_S_PMS3_ATTR_REG register
 *  SPI1 flash PMS section 3 attribute register
 */
#define SPI_FMEM_S_PMS3_ATTR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x10c)
/** SPI_FMEM_S_PMS3_RD_ATTR : R/W; bitpos: [0]; default: 1;
 *  1: SPI1 flash PMS section 3 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS3_RD_ATTR    (BIT(0))
#define SPI_FMEM_S_PMS3_RD_ATTR_M  (SPI_FMEM_S_PMS3_RD_ATTR_V << SPI_FMEM_S_PMS3_RD_ATTR_S)
#define SPI_FMEM_S_PMS3_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS3_RD_ATTR_S  0
/** SPI_FMEM_S_PMS3_WR_ATTR : R/W; bitpos: [1]; default: 1;
 *  1: SPI1 flash PMS section 3 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS3_WR_ATTR    (BIT(1))
#define SPI_FMEM_S_PMS3_WR_ATTR_M  (SPI_FMEM_S_PMS3_WR_ATTR_V << SPI_FMEM_S_PMS3_WR_ATTR_S)
#define SPI_FMEM_S_PMS3_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS3_WR_ATTR_S  1
/** SPI_FMEM_S_PMS3_ECC : R/W; bitpos: [2]; default: 0;
 *  SPI1 flash PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS
 *  section 3 is configured by registers SPI_FMEM_S_PMS3_ADDR_REG and
 *  SPI_FMEM_S_PMS3_SIZE_REG.
 */
#define SPI_FMEM_S_PMS3_ECC    (BIT(2))
#define SPI_FMEM_S_PMS3_ECC_M  (SPI_FMEM_S_PMS3_ECC_V << SPI_FMEM_S_PMS3_ECC_S)
#define SPI_FMEM_S_PMS3_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS3_ECC_S  2
/** SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR : R/W; bitpos: [3]; default: 1;
 *  1: SPI1 flash  non-secure PMS section 3 read accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR    (BIT(3))
#define SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR_M  (SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR_V << SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR_S)
#define SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS3_NONSECURE_RD_ATTR_S  3
/** SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR : R/W; bitpos: [4]; default: 1;
 *  1: SPI1 flash non-secure PMS section 3 write accessible. 0: Not allowed.
 */
#define SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR    (BIT(4))
#define SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR_M  (SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR_V << SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR_S)
#define SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR_V  0x00000001U
#define SPI_FMEM_S_PMS3_NONSECURE_WR_ATTR_S  4
/** SPI_FMEM_S_PMS3_NONSECURE_ECC : R/W; bitpos: [5]; default: 0;
 *  SPI1 flash non-secure PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it.
 *  The flash PMS section 3 is configured by registers SPI_FMEM_S_PMS3_ADDR_REG and
 *  SPI_FMEM_S_PMS3_SIZE_REG.
 */
#define SPI_FMEM_S_PMS3_NONSECURE_ECC    (BIT(5))
#define SPI_FMEM_S_PMS3_NONSECURE_ECC_M  (SPI_FMEM_S_PMS3_NONSECURE_ECC_V << SPI_FMEM_S_PMS3_NONSECURE_ECC_S)
#define SPI_FMEM_S_PMS3_NONSECURE_ECC_V  0x00000001U
#define SPI_FMEM_S_PMS3_NONSECURE_ECC_S  5

