espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_SMEM_S_PMS1_ADDR_REG register
 *  SPI1 external RAM PMS section 1 start address register
 */
#define SPI_SMEM_S_PMS1_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x144)
/** SPI_SMEM_S_PMS1_ADDR_S : R/W; bitpos: [28:0]; default: 0;
 *  SPI1 external RAM PMS section 1 start address value
 */
#define SPI_SMEM_S_PMS1_ADDR_S    0x1FFFFFFFU
#define SPI_SMEM_S_PMS1_ADDR_S_M  (SPI_SMEM_S_PMS1_ADDR_S_V << SPI_SMEM_S_PMS1_ADDR_S_S)
#define SPI_SMEM_S_PMS1_ADDR_S_V  0x1FFFFFFFU
#define SPI_SMEM_S_PMS1_ADDR_S_S  0

/** SPI_SMEM_S_PMS2_ADDR_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_SMEM_S_PMS2_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x148)
/** SPI_SMEM_S_PMS2_ADDR_S : R/W; bitpos: [28:0]; default: 0;
 *  SPI1 external RAM PMS section 2 start address value
 */
#define SPI_SMEM_S_PMS2_ADDR_S    0x1FFFFFFFU
#define SPI_SMEM_S_PMS2_ADDR_S_M  (SPI_SMEM_S_PMS2_ADDR_S_V << SPI_SMEM_S_PMS2_ADDR_S_S)
#define SPI_SMEM_S_PMS2_ADDR_S_V  0x1FFFFFFFU
#define SPI_SMEM_S_PMS2_ADDR_S_S  0

/** SPI_SMEM_S_PMS3_ADDR_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_SMEM_S_PMS3_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x14c)
/** SPI_SMEM_S_PMS3_ADDR_S : R/W; bitpos: [28:0]; default: 0;
 *  SPI1 external RAM PMS section 3 start address value
 */
#define SPI_SMEM_S_PMS3_ADDR_S    0x1FFFFFFFU
#define SPI_SMEM_S_PMS3_ADDR_S_M  (SPI_SMEM_S_PMS3_ADDR_S_V << SPI_SMEM_S_PMS3_ADDR_S_S)
#define SPI_SMEM_S_PMS3_ADDR_S_V  0x1FFFFFFFU
#define SPI_SMEM_S_PMS3_ADDR_S_S  0

/** SPI_SMEM_S_PMS0_SIZE_REG register
 *  SPI1 external RAM PMS section 0 start address register
 */
#define SPI_SMEM_S_PMS0_SIZE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x150)
/** SPI_SMEM_S_PMS0_SIZE : R/W; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 0 address region is (SPI_SMEM_S_PMS0_ADDR_S,
 *  SPI_SMEM_S_PMS0_ADDR_S + SPI_SMEM_S_PMS0_SIZE)
 */
#define SPI_SMEM_S_PMS0_SIZE    0x0001FFFFU
#define SPI_SMEM_S_PMS0_SIZE_M  (SPI_SMEM_S_PMS0_SIZE_V << SPI_SMEM_S_PMS0_SIZE_S)
#define SPI_SMEM_S_PMS0_SIZE_V  0x0001FFFFU
#define SPI_SMEM_S_PMS0_SIZE_S  0

/** SPI_SMEM_S_PMS1_SIZE_REG register
 *  SPI1 external RAM PMS section 1 start address register
 */
#define SPI_SMEM_S_PMS1_SIZE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x154)
/** SPI_SMEM_S_PMS1_SIZE : R/W; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 1 address region is (SPI_SMEM_S_PMS1_ADDR_S,
 *  SPI_SMEM_S_PMS1_ADDR_S + SPI_SMEM_S_PMS1_SIZE)
 */
#define SPI_SMEM_S_PMS1_SIZE    0x0001FFFFU
#define SPI_SMEM_S_PMS1_SIZE_M  (SPI_SMEM_S_PMS1_SIZE_V << SPI_SMEM_S_PMS1_SIZE_S)
#define SPI_SMEM_S_PMS1_SIZE_V  0x0001FFFFU
#define SPI_SMEM_S_PMS1_SIZE_S  0

/** SPI_SMEM_S_PMS2_SIZE_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_SMEM_S_PMS2_SIZE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x158)
/** SPI_SMEM_S_PMS2_SIZE : R/W; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 2 address region is (SPI_SMEM_S_PMS2_ADDR_S,
 *  SPI_SMEM_S_PMS2_ADDR_S + SPI_SMEM_S_PMS2_SIZE)
 */
#define SPI_SMEM_S_PMS2_SIZE    0x0001FFFFU
#define SPI_SMEM_S_PMS2_SIZE_M  (SPI_SMEM_S_PMS2_SIZE_V << SPI_SMEM_S_PMS2_SIZE_S)
#define SPI_SMEM_S_PMS2_SIZE_V  0x0001FFFFU
#define SPI_SMEM_S_PMS2_SIZE_S  0

/** SPI_SMEM_S_PMS3_SIZE_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_SMEM_S_PMS3_SIZE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x15c)
/** SPI_SMEM_S_PMS3_SIZE : R/W; bitpos: [16:0]; default: 4096;
 *  SPI1 external RAM PMS section 3 address region is (SPI_SMEM_S_PMS3_ADDR_S,
 *  SPI_SMEM_S_PMS3_ADDR_S + SPI_SMEM_S_PMS3_SIZE)
 */
#define SPI_SMEM_S_PMS3_SIZE    0x0001FFFFU
#define SPI_SMEM_S_PMS3_SIZE_M  (SPI_SMEM_S_PMS3_SIZE_V << SPI_SMEM_S_PMS3_SIZE_S)
#define SPI_SMEM_S_PMS3_SIZE_V  0x0001FFFFU
#define SPI_SMEM_S_PMS3_SIZE_S  0

/** SPI_MEM_S_PMS_REJECT_REG register
 *  SPI1 access reject register
 */
#define SPI_MEM_S_PMS_REJECT_REG (DR_REG_PSRAM_MSPI0_BASE + 0x160)
/** SPI_MEM_S_PM_EN : R/W; bitpos: [27]; default: 0;
 *  Set this bit to enable SPI0/1 transfer permission control function.
 */
#define SPI_MEM_S_PM_EN    (BIT(27))
#define SPI_MEM_S_PM_EN_M  (SPI_MEM_S_PM_EN_V << SPI_MEM_S_PM_EN_S)
#define SPI_MEM_S_PM_EN_V  0x00000001U
#define SPI_MEM_S_PM_EN_S  27
/** SPI_MEM_S_PMS_LD : R/SS/WTC; bitpos: [28]; default: 0;
 *  1: SPI1 write access error. 0: No write access error. It is cleared by when
 *  SPI_MEM_S_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_S_PMS_LD    (BIT(28))
#define SPI_MEM_S_PMS_LD_M  (SPI_MEM_S_PMS_LD_V << SPI_MEM_S_PMS_LD_S)
#define SPI_MEM_S_PMS_LD_V  0x00000001U
#define SPI_MEM_S_PMS_LD_S  28
/** SPI_MEM_S_PMS_ST : R/SS/WTC; bitpos: [29]; default: 0;
 *  1: SPI1 read access error. 0: No read access error. It is cleared by when
 *  SPI_MEM_S_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_S_PMS_ST    (BIT(29))
#define SPI_MEM_S_PMS_ST_M  (SPI_MEM_S_PMS_ST_V << SPI_MEM_S_PMS_ST_S)
#define SPI_MEM_S_PMS_ST_V  0x00000001U
#define SPI_MEM_S_PMS_ST_S  29
/** SPI_MEM_S_PMS_MULTI_HIT : R/SS/WTC; bitpos: [30]; default: 0;
 *  1: SPI1 access is rejected because of address miss. 0: No address miss error. It is
 *  cleared by when  SPI_MEM_S_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_S_PMS_MULTI_HIT    (BIT(30))
#define SPI_MEM_S_PMS_MULTI_HIT_M  (SPI_MEM_S_PMS_MULTI_HIT_V << SPI_MEM_S_PMS_MULTI_HIT_S)
#define SPI_MEM_S_PMS_MULTI_HIT_V  0x00000001U
#define SPI_MEM_S_PMS_MULTI_HIT_S  30
/** SPI_MEM_S_PMS_IVD : R/SS/WTC; bitpos: [31]; default: 0;
 *  1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit
 *  error. It is cleared by when  SPI_MEM_S_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_S_PMS_IVD    (BIT(31))
#define SPI_MEM_S_PMS_IVD_M  (SPI_MEM_S_PMS_IVD_V << SPI_MEM_S_PMS_IVD_S)
#define SPI_MEM_S_PMS_IVD_V  0x00000001U
#define SPI_MEM_S_PMS_IVD_S  31

/** SPI_MEM_S_PMS_REJECT_ADDR_REG register
 *  SPI1 access reject addr register
 */
#define SPI_MEM_S_PMS_REJECT_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x164)
/** SPI_MEM_S_REJECT_ADDR : R/SS/WTC; bitpos: [28:0]; default: 0;
 *  This bits show the first SPI1 access error address. It is cleared by when
 *  SPI_MEM_S_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_S_REJECT_ADDR    0x1FFFFFFFU
#define SPI_MEM_S_REJECT_ADDR_M  (SPI_MEM_S_REJECT_ADDR_V << SPI_MEM_S_REJECT_ADDR_S)
#define SPI_MEM_S_REJECT_ADDR_V  0x1FFFFFFFU
#define SPI_MEM_S_REJECT_ADDR_S  0

