espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_SMEM_S_DOUT_MODE_REG register
 *  MSPI external RAM output timing adjustment control register
 */
#define SPI_SMEM_S_DOUT_MODE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x19c)
/** SPI_SMEM_S_DOUT0_MODE : R/W; bitpos: [0]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT0_MODE    (BIT(0))
#define SPI_SMEM_S_DOUT0_MODE_M  (SPI_SMEM_S_DOUT0_MODE_V << SPI_SMEM_S_DOUT0_MODE_S)
#define SPI_SMEM_S_DOUT0_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT0_MODE_S  0
/** SPI_SMEM_S_DOUT1_MODE : R/W; bitpos: [1]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT1_MODE    (BIT(1))
#define SPI_SMEM_S_DOUT1_MODE_M  (SPI_SMEM_S_DOUT1_MODE_V << SPI_SMEM_S_DOUT1_MODE_S)
#define SPI_SMEM_S_DOUT1_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT1_MODE_S  1
/** SPI_SMEM_S_DOUT2_MODE : R/W; bitpos: [2]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT2_MODE    (BIT(2))
#define SPI_SMEM_S_DOUT2_MODE_M  (SPI_SMEM_S_DOUT2_MODE_V << SPI_SMEM_S_DOUT2_MODE_S)
#define SPI_SMEM_S_DOUT2_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT2_MODE_S  2
/** SPI_SMEM_S_DOUT3_MODE : R/W; bitpos: [3]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT3_MODE    (BIT(3))
#define SPI_SMEM_S_DOUT3_MODE_M  (SPI_SMEM_S_DOUT3_MODE_V << SPI_SMEM_S_DOUT3_MODE_S)
#define SPI_SMEM_S_DOUT3_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT3_MODE_S  3
/** SPI_SMEM_S_DOUT4_MODE : R/W; bitpos: [4]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT4_MODE    (BIT(4))
#define SPI_SMEM_S_DOUT4_MODE_M  (SPI_SMEM_S_DOUT4_MODE_V << SPI_SMEM_S_DOUT4_MODE_S)
#define SPI_SMEM_S_DOUT4_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT4_MODE_S  4
/** SPI_SMEM_S_DOUT5_MODE : R/W; bitpos: [5]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT5_MODE    (BIT(5))
#define SPI_SMEM_S_DOUT5_MODE_M  (SPI_SMEM_S_DOUT5_MODE_V << SPI_SMEM_S_DOUT5_MODE_S)
#define SPI_SMEM_S_DOUT5_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT5_MODE_S  5
/** SPI_SMEM_S_DOUT6_MODE : R/W; bitpos: [6]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT6_MODE    (BIT(6))
#define SPI_SMEM_S_DOUT6_MODE_M  (SPI_SMEM_S_DOUT6_MODE_V << SPI_SMEM_S_DOUT6_MODE_S)
#define SPI_SMEM_S_DOUT6_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT6_MODE_S  6
/** SPI_SMEM_S_DOUT7_MODE : R/W; bitpos: [7]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT7_MODE    (BIT(7))
#define SPI_SMEM_S_DOUT7_MODE_M  (SPI_SMEM_S_DOUT7_MODE_V << SPI_SMEM_S_DOUT7_MODE_S)
#define SPI_SMEM_S_DOUT7_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT7_MODE_S  7
/** SPI_SMEM_S_DOUTS_MODE : R/W; bitpos: [8]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUTS_MODE    (BIT(8))
#define SPI_SMEM_S_DOUTS_MODE_M  (SPI_SMEM_S_DOUTS_MODE_V << SPI_SMEM_S_DOUTS_MODE_S)
#define SPI_SMEM_S_DOUTS_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUTS_MODE_S  8

/** SPI_SMEM_S_AC_REG register
 *  MSPI external RAM ECC and SPI CS timing control register
 */
#define SPI_SMEM_S_AC_REG (DR_REG_PSRAM_MSPI0_BASE + 0x1a0)
/** SPI_SMEM_S_CS_SETUP : R/W; bitpos: [0]; default: 0;
 *  For SPI0 and SPI1, spi cs is enable when spi is in prepare phase. 1: enable 0:
 *  disable.
 */
#define SPI_SMEM_S_CS_SETUP    (BIT(0))
#define SPI_SMEM_S_CS_SETUP_M  (SPI_SMEM_S_CS_SETUP_V << SPI_SMEM_S_CS_SETUP_S)
#define SPI_SMEM_S_CS_SETUP_V  0x00000001U
#define SPI_SMEM_S_CS_SETUP_S  0
/** SPI_SMEM_S_CS_HOLD : R/W; bitpos: [1]; default: 0;
 *  For SPI0 and SPI1, spi cs keep low when spi is in done phase. 1: enable 0: disable.
 */
#define SPI_SMEM_S_CS_HOLD    (BIT(1))
#define SPI_SMEM_S_CS_HOLD_M  (SPI_SMEM_S_CS_HOLD_V << SPI_SMEM_S_CS_HOLD_S)
#define SPI_SMEM_S_CS_HOLD_V  0x00000001U
#define SPI_SMEM_S_CS_HOLD_S  1
/** SPI_SMEM_S_CS_SETUP_TIME : R/W; bitpos: [6:2]; default: 1;
 *  For spi0, (cycles-1) of prepare phase by spi clock this bits are combined with
 *  spi_mem_cs_setup bit.
 */
#define SPI_SMEM_S_CS_SETUP_TIME    0x0000001FU
#define SPI_SMEM_S_CS_SETUP_TIME_M  (SPI_SMEM_S_CS_SETUP_TIME_V << SPI_SMEM_S_CS_SETUP_TIME_S)
#define SPI_SMEM_S_CS_SETUP_TIME_V  0x0000001FU
#define SPI_SMEM_S_CS_SETUP_TIME_S  2
/** SPI_SMEM_S_CS_HOLD_TIME : R/W; bitpos: [11:7]; default: 1;
 *  For SPI0 and SPI1, spi cs signal is delayed to inactive by spi clock this bits are
 *  combined with spi_mem_cs_hold bit.
 */
#define SPI_SMEM_S_CS_HOLD_TIME    0x0000001FU
#define SPI_SMEM_S_CS_HOLD_TIME_M  (SPI_SMEM_S_CS_HOLD_TIME_V << SPI_SMEM_S_CS_HOLD_TIME_S)
#define SPI_SMEM_S_CS_HOLD_TIME_V  0x0000001FU
#define SPI_SMEM_S_CS_HOLD_TIME_S  7
/** SPI_SMEM_S_ECC_CS_HOLD_TIME : R/W; bitpos: [14:12]; default: 3;
 *  SPI_SMEM_S_CS_HOLD_TIME + SPI_SMEM_S_ECC_CS_HOLD_TIME is the SPI0 and SPI1 CS hold
 *  cycles in ECC mode when accessed external RAM.
 */
#define SPI_SMEM_S_ECC_CS_HOLD_TIME    0x00000007U
#define SPI_SMEM_S_ECC_CS_HOLD_TIME_M  (SPI_SMEM_S_ECC_CS_HOLD_TIME_V << SPI_SMEM_S_ECC_CS_HOLD_TIME_S)
#define SPI_SMEM_S_ECC_CS_HOLD_TIME_V  0x00000007U
#define SPI_SMEM_S_ECC_CS_HOLD_TIME_S  12
/** SPI_SMEM_S_ECC_SKIP_PAGE_CORNER : R/W; bitpos: [15]; default: 1;
 *  1: SPI0 skips page corner when accesses external RAM. 0: Not skip page corner when
 *  accesses external RAM.
 */
#define SPI_SMEM_S_ECC_SKIP_PAGE_CORNER    (BIT(15))
#define SPI_SMEM_S_ECC_SKIP_PAGE_CORNER_M  (SPI_SMEM_S_ECC_SKIP_PAGE_CORNER_V << SPI_SMEM_S_ECC_SKIP_PAGE_CORNER_S)
#define SPI_SMEM_S_ECC_SKIP_PAGE_CORNER_V  0x00000001U
#define SPI_SMEM_S_ECC_SKIP_PAGE_CORNER_S  15
/** SPI_SMEM_S_ECC_16TO18_BYTE_EN : R/W; bitpos: [16]; default: 0;
 *  Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode when
 *  accesses external RAM.
 */
#define SPI_SMEM_S_ECC_16TO18_BYTE_EN    (BIT(16))
#define SPI_SMEM_S_ECC_16TO18_BYTE_EN_M  (SPI_SMEM_S_ECC_16TO18_BYTE_EN_V << SPI_SMEM_S_ECC_16TO18_BYTE_EN_S)
#define SPI_SMEM_S_ECC_16TO18_BYTE_EN_V  0x00000001U
#define SPI_SMEM_S_ECC_16TO18_BYTE_EN_S  16
/** SPI_SMEM_S_CS_HOLD_DELAY : R/W; bitpos: [30:25]; default: 0;
 *  These bits are used to set the minimum CS high time tSHSL between SPI burst
 *  transfer when accesses to external RAM. tSHSL is (SPI_SMEM_S_CS_HOLD_DELAY[5:0] + 1)
 *  MSPI core clock cycles.
 */
#define SPI_SMEM_S_CS_HOLD_DELAY    0x0000003FU
#define SPI_SMEM_S_CS_HOLD_DELAY_M  (SPI_SMEM_S_CS_HOLD_DELAY_V << SPI_SMEM_S_CS_HOLD_DELAY_S)
#define SPI_SMEM_S_CS_HOLD_DELAY_V  0x0000003FU
#define SPI_SMEM_S_CS_HOLD_DELAY_S  25
/** SPI_SMEM_S_SPLIT_TRANS_EN : R/W; bitpos: [31]; default: 0;
 *  Set this bit to enable SPI0 split one AXI accesses EXT_RAM transfer into two SPI
 *  transfers when one transfer will cross flash/EXT_RAM page corner, valid no matter
 *  whether there is an ECC region or not.
 */
#define SPI_SMEM_S_SPLIT_TRANS_EN    (BIT(31))
#define SPI_SMEM_S_SPLIT_TRANS_EN_M  (SPI_SMEM_S_SPLIT_TRANS_EN_V << SPI_SMEM_S_SPLIT_TRANS_EN_S)
#define SPI_SMEM_S_SPLIT_TRANS_EN_V  0x00000001U
#define SPI_SMEM_S_SPLIT_TRANS_EN_S  31

/** SPI_SMEM_S_DIN_HEX_MODE_REG register
 *  MSPI 16x external RAM input timing delay mode control register
 */
#define SPI_SMEM_S_DIN_HEX_MODE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x1a4)
/** SPI_SMEM_S_DIN08_MODE : R/W; bitpos: [2:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN08_MODE    0x00000007U
#define SPI_SMEM_S_DIN08_MODE_M  (SPI_SMEM_S_DIN08_MODE_V << SPI_SMEM_S_DIN08_MODE_S)
#define SPI_SMEM_S_DIN08_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN08_MODE_S  0
/** SPI_SMEM_S_DIN09_MODE : R/W; bitpos: [5:3]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN09_MODE    0x00000007U
#define SPI_SMEM_S_DIN09_MODE_M  (SPI_SMEM_S_DIN09_MODE_V << SPI_SMEM_S_DIN09_MODE_S)
#define SPI_SMEM_S_DIN09_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN09_MODE_S  3
/** SPI_SMEM_S_DIN10_MODE : R/W; bitpos: [8:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN10_MODE    0x00000007U
#define SPI_SMEM_S_DIN10_MODE_M  (SPI_SMEM_S_DIN10_MODE_V << SPI_SMEM_S_DIN10_MODE_S)
#define SPI_SMEM_S_DIN10_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN10_MODE_S  6
/** SPI_SMEM_S_DIN11_MODE : R/W; bitpos: [11:9]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN11_MODE    0x00000007U
#define SPI_SMEM_S_DIN11_MODE_M  (SPI_SMEM_S_DIN11_MODE_V << SPI_SMEM_S_DIN11_MODE_S)
#define SPI_SMEM_S_DIN11_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN11_MODE_S  9
/** SPI_SMEM_S_DIN12_MODE : R/W; bitpos: [14:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN12_MODE    0x00000007U
#define SPI_SMEM_S_DIN12_MODE_M  (SPI_SMEM_S_DIN12_MODE_V << SPI_SMEM_S_DIN12_MODE_S)
#define SPI_SMEM_S_DIN12_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN12_MODE_S  12
/** SPI_SMEM_S_DIN13_MODE : R/W; bitpos: [17:15]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN13_MODE    0x00000007U
#define SPI_SMEM_S_DIN13_MODE_M  (SPI_SMEM_S_DIN13_MODE_V << SPI_SMEM_S_DIN13_MODE_S)
#define SPI_SMEM_S_DIN13_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN13_MODE_S  15
/** SPI_SMEM_S_DIN14_MODE : R/W; bitpos: [20:18]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN14_MODE    0x00000007U
#define SPI_SMEM_S_DIN14_MODE_M  (SPI_SMEM_S_DIN14_MODE_V << SPI_SMEM_S_DIN14_MODE_S)
#define SPI_SMEM_S_DIN14_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN14_MODE_S  18
/** SPI_SMEM_S_DIN15_MODE : R/W; bitpos: [23:21]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DIN15_MODE    0x00000007U
#define SPI_SMEM_S_DIN15_MODE_M  (SPI_SMEM_S_DIN15_MODE_V << SPI_SMEM_S_DIN15_MODE_S)
#define SPI_SMEM_S_DIN15_MODE_V  0x00000007U
#define SPI_SMEM_S_DIN15_MODE_S  21
/** SPI_SMEM_S_DINS_HEX_MODE : R/W; bitpos: [26:24]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_SMEM_S_DINS_HEX_MODE    0x00000007U
#define SPI_SMEM_S_DINS_HEX_MODE_M  (SPI_SMEM_S_DINS_HEX_MODE_V << SPI_SMEM_S_DINS_HEX_MODE_S)
#define SPI_SMEM_S_DINS_HEX_MODE_V  0x00000007U
#define SPI_SMEM_S_DINS_HEX_MODE_S  24

/** SPI_SMEM_S_DIN_HEX_NUM_REG register
 *  MSPI 16x external RAM input timing delay number control register
 */
#define SPI_SMEM_S_DIN_HEX_NUM_REG (DR_REG_PSRAM_MSPI0_BASE + 0x1a8)
/** SPI_SMEM_S_DIN08_NUM : R/W; bitpos: [1:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN08_NUM    0x00000003U
#define SPI_SMEM_S_DIN08_NUM_M  (SPI_SMEM_S_DIN08_NUM_V << SPI_SMEM_S_DIN08_NUM_S)
#define SPI_SMEM_S_DIN08_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN08_NUM_S  0
/** SPI_SMEM_S_DIN09_NUM : R/W; bitpos: [3:2]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN09_NUM    0x00000003U
#define SPI_SMEM_S_DIN09_NUM_M  (SPI_SMEM_S_DIN09_NUM_V << SPI_SMEM_S_DIN09_NUM_S)
#define SPI_SMEM_S_DIN09_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN09_NUM_S  2
/** SPI_SMEM_S_DIN10_NUM : R/W; bitpos: [5:4]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN10_NUM    0x00000003U
#define SPI_SMEM_S_DIN10_NUM_M  (SPI_SMEM_S_DIN10_NUM_V << SPI_SMEM_S_DIN10_NUM_S)
#define SPI_SMEM_S_DIN10_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN10_NUM_S  4
/** SPI_SMEM_S_DIN11_NUM : R/W; bitpos: [7:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN11_NUM    0x00000003U
#define SPI_SMEM_S_DIN11_NUM_M  (SPI_SMEM_S_DIN11_NUM_V << SPI_SMEM_S_DIN11_NUM_S)
#define SPI_SMEM_S_DIN11_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN11_NUM_S  6
/** SPI_SMEM_S_DIN12_NUM : R/W; bitpos: [9:8]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN12_NUM    0x00000003U
#define SPI_SMEM_S_DIN12_NUM_M  (SPI_SMEM_S_DIN12_NUM_V << SPI_SMEM_S_DIN12_NUM_S)
#define SPI_SMEM_S_DIN12_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN12_NUM_S  8
/** SPI_SMEM_S_DIN13_NUM : R/W; bitpos: [11:10]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN13_NUM    0x00000003U
#define SPI_SMEM_S_DIN13_NUM_M  (SPI_SMEM_S_DIN13_NUM_V << SPI_SMEM_S_DIN13_NUM_S)
#define SPI_SMEM_S_DIN13_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN13_NUM_S  10
/** SPI_SMEM_S_DIN14_NUM : R/W; bitpos: [13:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN14_NUM    0x00000003U
#define SPI_SMEM_S_DIN14_NUM_M  (SPI_SMEM_S_DIN14_NUM_V << SPI_SMEM_S_DIN14_NUM_S)
#define SPI_SMEM_S_DIN14_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN14_NUM_S  12
/** SPI_SMEM_S_DIN15_NUM : R/W; bitpos: [15:14]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DIN15_NUM    0x00000003U
#define SPI_SMEM_S_DIN15_NUM_M  (SPI_SMEM_S_DIN15_NUM_V << SPI_SMEM_S_DIN15_NUM_S)
#define SPI_SMEM_S_DIN15_NUM_V  0x00000003U
#define SPI_SMEM_S_DIN15_NUM_S  14
/** SPI_SMEM_S_DINS_HEX_NUM : R/W; bitpos: [17:16]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_SMEM_S_DINS_HEX_NUM    0x00000003U
#define SPI_SMEM_S_DINS_HEX_NUM_M  (SPI_SMEM_S_DINS_HEX_NUM_V << SPI_SMEM_S_DINS_HEX_NUM_S)
#define SPI_SMEM_S_DINS_HEX_NUM_V  0x00000003U
#define SPI_SMEM_S_DINS_HEX_NUM_S  16

