espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_SMEM_S_DOUT_HEX_MODE_REG register
 *  MSPI 16x external RAM output timing adjustment control register
 */
#define SPI_SMEM_S_DOUT_HEX_MODE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x1ac)
/** SPI_SMEM_S_DOUT08_MODE : R/W; bitpos: [0]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT08_MODE    (BIT(0))
#define SPI_SMEM_S_DOUT08_MODE_M  (SPI_SMEM_S_DOUT08_MODE_V << SPI_SMEM_S_DOUT08_MODE_S)
#define SPI_SMEM_S_DOUT08_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT08_MODE_S  0
/** SPI_SMEM_S_DOUT09_MODE : R/W; bitpos: [1]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT09_MODE    (BIT(1))
#define SPI_SMEM_S_DOUT09_MODE_M  (SPI_SMEM_S_DOUT09_MODE_V << SPI_SMEM_S_DOUT09_MODE_S)
#define SPI_SMEM_S_DOUT09_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT09_MODE_S  1
/** SPI_SMEM_S_DOUT10_MODE : R/W; bitpos: [2]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT10_MODE    (BIT(2))
#define SPI_SMEM_S_DOUT10_MODE_M  (SPI_SMEM_S_DOUT10_MODE_V << SPI_SMEM_S_DOUT10_MODE_S)
#define SPI_SMEM_S_DOUT10_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT10_MODE_S  2
/** SPI_SMEM_S_DOUT11_MODE : R/W; bitpos: [3]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT11_MODE    (BIT(3))
#define SPI_SMEM_S_DOUT11_MODE_M  (SPI_SMEM_S_DOUT11_MODE_V << SPI_SMEM_S_DOUT11_MODE_S)
#define SPI_SMEM_S_DOUT11_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT11_MODE_S  3
/** SPI_SMEM_S_DOUT12_MODE : R/W; bitpos: [4]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT12_MODE    (BIT(4))
#define SPI_SMEM_S_DOUT12_MODE_M  (SPI_SMEM_S_DOUT12_MODE_V << SPI_SMEM_S_DOUT12_MODE_S)
#define SPI_SMEM_S_DOUT12_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT12_MODE_S  4
/** SPI_SMEM_S_DOUT13_MODE : R/W; bitpos: [5]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT13_MODE    (BIT(5))
#define SPI_SMEM_S_DOUT13_MODE_M  (SPI_SMEM_S_DOUT13_MODE_V << SPI_SMEM_S_DOUT13_MODE_S)
#define SPI_SMEM_S_DOUT13_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT13_MODE_S  5
/** SPI_SMEM_S_DOUT14_MODE : R/W; bitpos: [6]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT14_MODE    (BIT(6))
#define SPI_SMEM_S_DOUT14_MODE_M  (SPI_SMEM_S_DOUT14_MODE_V << SPI_SMEM_S_DOUT14_MODE_S)
#define SPI_SMEM_S_DOUT14_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT14_MODE_S  6
/** SPI_SMEM_S_DOUT15_MODE : R/W; bitpos: [7]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUT15_MODE    (BIT(7))
#define SPI_SMEM_S_DOUT15_MODE_M  (SPI_SMEM_S_DOUT15_MODE_V << SPI_SMEM_S_DOUT15_MODE_S)
#define SPI_SMEM_S_DOUT15_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUT15_MODE_S  7
/** SPI_SMEM_S_DOUTS_HEX_MODE : R/W; bitpos: [8]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_SMEM_S_DOUTS_HEX_MODE    (BIT(8))
#define SPI_SMEM_S_DOUTS_HEX_MODE_M  (SPI_SMEM_S_DOUTS_HEX_MODE_V << SPI_SMEM_S_DOUTS_HEX_MODE_S)
#define SPI_SMEM_S_DOUTS_HEX_MODE_V  0x00000001U
#define SPI_SMEM_S_DOUTS_HEX_MODE_S  8

/** SPI_MEM_S_CLOCK_GATE_REG register
 *  SPI0 clock gate register
 */
#define SPI_MEM_S_CLOCK_GATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x200)
/** SPI_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Register clock gate enable signal. 1: Enable. 0: Disable.
 */
#define SPI_CLK_EN    (BIT(0))
#define SPI_CLK_EN_M  (SPI_CLK_EN_V << SPI_CLK_EN_S)
#define SPI_CLK_EN_V  0x00000001U
#define SPI_CLK_EN_S  0
/** SPI_MSPI_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  MSPI lowpower function clock gate force on signal. 1: Enable. 0: Disable.
 */
#define SPI_MSPI_CLK_FORCE_ON    (BIT(1))
#define SPI_MSPI_CLK_FORCE_ON_M  (SPI_MSPI_CLK_FORCE_ON_V << SPI_MSPI_CLK_FORCE_ON_S)
#define SPI_MSPI_CLK_FORCE_ON_V  0x00000001U
#define SPI_MSPI_CLK_FORCE_ON_S  1

/** SPI_MEM_S_NAND_FLASH_EN_REG register
 *  NAND FLASH control register
 */
#define SPI_MEM_S_NAND_FLASH_EN_REG (DR_REG_PSRAM_MSPI0_BASE + 0x204)
/** SPI_MEM_S_NAND_FLASH_EN : HRO; bitpos: [0]; default: 0;
 *  NAND FLASH function enable signal. 1: Enable NAND FLASH, Disable NOR FLASH. 0:
 *  Disable NAND FLASH, Enable NOR FLASH.
 */
#define SPI_MEM_S_NAND_FLASH_EN    (BIT(0))
#define SPI_MEM_S_NAND_FLASH_EN_M  (SPI_MEM_S_NAND_FLASH_EN_V << SPI_MEM_S_NAND_FLASH_EN_S)
#define SPI_MEM_S_NAND_FLASH_EN_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_EN_S  0
/** SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX : HRO; bitpos: [15:1]; default: 32767;
 *  NAND FLASH spi seq head index configure register. Every 5 bits represent  the 1st
 *  index of a SPI CMD sequence.[14:10]:usr; [9:5]:axi_rd; [4:0]:axi_wr.
 */
#define SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX    0x00007FFFU
#define SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX_M  (SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX_V << SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX_S)
#define SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX_V  0x00007FFFU
#define SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX_S  1
/** SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG : HRO; bitpos: [16]; default: 0;
 *  NAND FLASH spi seq user trigger configure register. SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG
 *  is corresponds to SPI_MEM_S_NAND_FLASH_SEQ_HD_INDEX[14:10].1: enable 0: disable.
 */
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG    (BIT(16))
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG_M  (SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG_V << SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG_S)
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG_S  16
/** SPI_MEM_S_NAND_FLASH_LUT_EN : HRO; bitpos: [17]; default: 0;
 *  NAND FLASH spi seq & cmd lut cfg en. 1: enable 0: disable.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_EN    (BIT(17))
#define SPI_MEM_S_NAND_FLASH_LUT_EN_M  (SPI_MEM_S_NAND_FLASH_LUT_EN_V << SPI_MEM_S_NAND_FLASH_LUT_EN_S)
#define SPI_MEM_S_NAND_FLASH_LUT_EN_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_LUT_EN_S  17
/** SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND : HRO; bitpos: [18]; default: 0;
 *  Used with SPI_MEM_S_NAND_FLASH_SEQ_USR_TRIG to indicate the last page program ,and to
 *  execute page execute. 1: write end 0: write in a page size.
 */
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND    (BIT(18))
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND_M  (SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND_V << SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND_S)
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_SEQ_USR_WEND_S  18

/** SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG (DR_REG_PSRAM_MSPI0_BASE + 0x208)
/** SPI_MEM_S_NAND_FLASH_SR_ADDR0 : HRO; bitpos: [7:0]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_S_NAND_FLASH_SR_ADDR0    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR0_M  (SPI_MEM_S_NAND_FLASH_SR_ADDR0_V << SPI_MEM_S_NAND_FLASH_SR_ADDR0_S)
#define SPI_MEM_S_NAND_FLASH_SR_ADDR0_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR0_S  0
/** SPI_MEM_S_NAND_FLASH_SR_ADDR1 : HRO; bitpos: [15:8]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_S_NAND_FLASH_SR_ADDR1    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR1_M  (SPI_MEM_S_NAND_FLASH_SR_ADDR1_V << SPI_MEM_S_NAND_FLASH_SR_ADDR1_S)
#define SPI_MEM_S_NAND_FLASH_SR_ADDR1_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR1_S  8
/** SPI_MEM_S_NAND_FLASH_SR_ADDR2 : HRO; bitpos: [23:16]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_S_NAND_FLASH_SR_ADDR2    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR2_M  (SPI_MEM_S_NAND_FLASH_SR_ADDR2_V << SPI_MEM_S_NAND_FLASH_SR_ADDR2_S)
#define SPI_MEM_S_NAND_FLASH_SR_ADDR2_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR2_S  16
/** SPI_MEM_S_NAND_FLASH_SR_ADDR3 : HRO; bitpos: [31:24]; default: 0;
 *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
 *  could configure C0H into this register
 */
#define SPI_MEM_S_NAND_FLASH_SR_ADDR3    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR3_M  (SPI_MEM_S_NAND_FLASH_SR_ADDR3_V << SPI_MEM_S_NAND_FLASH_SR_ADDR3_S)
#define SPI_MEM_S_NAND_FLASH_SR_ADDR3_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_ADDR3_S  24

/** SPI_MEM_S_NAND_FLASH_SR_DIN0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_SR_DIN0_REG (DR_REG_PSRAM_MSPI0_BASE + 0x20c)
/** SPI_MEM_S_NAND_FLASH_SR_DIN0 : RO; bitpos: [7:0]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_S_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_S_NAND_FLASH_SR_DIN0    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN0_M  (SPI_MEM_S_NAND_FLASH_SR_DIN0_V << SPI_MEM_S_NAND_FLASH_SR_DIN0_S)
#define SPI_MEM_S_NAND_FLASH_SR_DIN0_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN0_S  0
/** SPI_MEM_S_NAND_FLASH_SR_DIN1 : RO; bitpos: [15:8]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_S_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_S_NAND_FLASH_SR_DIN1    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN1_M  (SPI_MEM_S_NAND_FLASH_SR_DIN1_V << SPI_MEM_S_NAND_FLASH_SR_DIN1_S)
#define SPI_MEM_S_NAND_FLASH_SR_DIN1_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN1_S  8
/** SPI_MEM_S_NAND_FLASH_SR_DIN2 : RO; bitpos: [23:16]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_S_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_S_NAND_FLASH_SR_DIN2    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN2_M  (SPI_MEM_S_NAND_FLASH_SR_DIN2_V << SPI_MEM_S_NAND_FLASH_SR_DIN2_S)
#define SPI_MEM_S_NAND_FLASH_SR_DIN2_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN2_S  16
/** SPI_MEM_S_NAND_FLASH_SR_DIN3 : RO; bitpos: [31:24]; default: 0;
 *  spi read state register data to this register for SPI SEQ need.
 *  SPI_MEM_S_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_S_NAND_FLASH_SR_ADDR0_REG.
 */
#define SPI_MEM_S_NAND_FLASH_SR_DIN3    0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN3_M  (SPI_MEM_S_NAND_FLASH_SR_DIN3_V << SPI_MEM_S_NAND_FLASH_SR_DIN3_S)
#define SPI_MEM_S_NAND_FLASH_SR_DIN3_V  0x000000FFU
#define SPI_MEM_S_NAND_FLASH_SR_DIN3_S  24

/** SPI_MEM_S_NAND_FLASH_CFG_DATA0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA0_REG (DR_REG_PSRAM_MSPI0_BASE + 0x210)
/** SPI_MEM_S_NAND_FLASH_CFG_DATA0 : HRO; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA0    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA0_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA0_V << SPI_MEM_S_NAND_FLASH_CFG_DATA0_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA0_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA0_S  0
/** SPI_MEM_S_NAND_FLASH_CFG_DATA1 : HRO; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA1    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA1_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA1_V << SPI_MEM_S_NAND_FLASH_CFG_DATA1_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA1_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA1_S  16

