espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_MEM_S_NAND_FLASH_CFG_DATA1_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA1_REG (DR_REG_PSRAM_MSPI0_BASE + 0x214)
/** SPI_MEM_S_NAND_FLASH_CFG_DATA2 : HRO; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA2    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA2_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA2_V << SPI_MEM_S_NAND_FLASH_CFG_DATA2_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA2_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA2_S  0
/** SPI_MEM_S_NAND_FLASH_CFG_DATA3 : HRO; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA3    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA3_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA3_V << SPI_MEM_S_NAND_FLASH_CFG_DATA3_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA3_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA3_S  16

/** SPI_MEM_S_NAND_FLASH_CFG_DATA2_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA2_REG (DR_REG_PSRAM_MSPI0_BASE + 0x218)
/** SPI_MEM_S_NAND_FLASH_CFG_DATA4 : HRO; bitpos: [15:0]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA4    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA4_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA4_V << SPI_MEM_S_NAND_FLASH_CFG_DATA4_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA4_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA4_S  0
/** SPI_MEM_S_NAND_FLASH_CFG_DATA5 : HRO; bitpos: [31:16]; default: 0;
 *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
 *  FLASH or compare read data
 */
#define SPI_MEM_S_NAND_FLASH_CFG_DATA5    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA5_M  (SPI_MEM_S_NAND_FLASH_CFG_DATA5_V << SPI_MEM_S_NAND_FLASH_CFG_DATA5_S)
#define SPI_MEM_S_NAND_FLASH_CFG_DATA5_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_CFG_DATA5_S  16

/** SPI_MEM_S_NAND_FLASH_CMD_LUT0_REG register
 *  MSPI NAND FLASH CMD LUT control register
 */
#define SPI_MEM_S_NAND_FLASH_CMD_LUT0_REG (DR_REG_PSRAM_MSPI0_BASE + 0x240)
/** SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0 : HRO; bitpos: [15:0]; default: 0;
 *  MSPI NAND FLASH config cmd value at cmd lut address 0.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0    0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0_M  (SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0_V << SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0_V  0x0000FFFFU
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_VALUE0_S  0
/** SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0 : HRO; bitpos: [19:16]; default: 0;
 *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable;
 *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0_M  (SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0_V << SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_SFSM_ST_EN0_S  16
/** SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0 : HRO; bitpos: [23:20]; default: 0;
 *  MSPI NAND FLASH config cmd length at cmd lut address 0.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0_M  (SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0_V << SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_CMD_LEN0_S  20
/** SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0 : HRO; bitpos: [27:24]; default: 0;
 *  MSPI NAND FLASH config address length at cmd lut address 0.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0_M  (SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0_V << SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_LUT_ADDR_LEN0_S  24
/** SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0 : HRO; bitpos: [29:28]; default: 0;
 *  MSPI NAND FLASH config data length at cmd lut address 0.
 */
#define SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0    0x00000003U
#define SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0_M  (SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0_V << SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0_V  0x00000003U
#define SPI_MEM_S_NAND_FLASH_LUT_DATA_LEN0_S  28
/** SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0 : HRO; bitpos: [30]; default: 0;
 *  MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode
 *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
 *  these registers are described to indicate the SPI_MEM_S_NAND_FLASH_CMD_LUT0_REG's
 *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
 *  16 )
 */
#define SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0    (BIT(30))
#define SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0_M  (SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0_V << SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0_S)
#define SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_LUT_BUS_EN0_S  30

/** SPI_MEM_S_NAND_FLASH_SPI_SEQ0_REG register
 *  NAND FLASH SPI SEQ control register
 */
#define SPI_MEM_S_NAND_FLASH_SPI_SEQ0_REG (DR_REG_PSRAM_MSPI0_BASE + 0x280)
/** SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0 : HRO; bitpos: [0]; default: 0;
 *  MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for
 *  sequence. 0: Not the last index.
 */
#define SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0    (BIT(0))
#define SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0_M  (SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0_V << SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0_S)
#define SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_SEQ_TAIL_FLG0_S  0
/** SPI_MEM_S_NAND_FLASH_SR_CHK_EN0 : HRO; bitpos: [1]; default: 0;
 *  MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.
 */
#define SPI_MEM_S_NAND_FLASH_SR_CHK_EN0    (BIT(1))
#define SPI_MEM_S_NAND_FLASH_SR_CHK_EN0_M  (SPI_MEM_S_NAND_FLASH_SR_CHK_EN0_V << SPI_MEM_S_NAND_FLASH_SR_CHK_EN0_S)
#define SPI_MEM_S_NAND_FLASH_SR_CHK_EN0_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_SR_CHK_EN0_S  1
/** SPI_MEM_S_NAND_FLASH_DIN_INDEX0 : HRO; bitpos: [5:2]; default: 0;
 *  MSPI NAND FLASH config din_index at spi seq index 0.  Use with
 *  SPI_MEM_S_NAND_FLASH_CFG_DATA
 */
#define SPI_MEM_S_NAND_FLASH_DIN_INDEX0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_DIN_INDEX0_M  (SPI_MEM_S_NAND_FLASH_DIN_INDEX0_V << SPI_MEM_S_NAND_FLASH_DIN_INDEX0_S)
#define SPI_MEM_S_NAND_FLASH_DIN_INDEX0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_DIN_INDEX0_S  2
/** SPI_MEM_S_NAND_FLASH_ADDR_INDEX0 : HRO; bitpos: [9:6]; default: 0;
 *  MSPI NAND FLASH config addr_index at spi seq index 0.  Use with
 *  SPI_MEM_S_NAND_FLASH_SR_ADDR
 */
#define SPI_MEM_S_NAND_FLASH_ADDR_INDEX0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_ADDR_INDEX0_M  (SPI_MEM_S_NAND_FLASH_ADDR_INDEX0_V << SPI_MEM_S_NAND_FLASH_ADDR_INDEX0_S)
#define SPI_MEM_S_NAND_FLASH_ADDR_INDEX0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_ADDR_INDEX0_S  6
/** SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0 : HRO; bitpos: [10]; default: 0;
 *  MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI
 *  SEQ configuration.
 */
#define SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0    (BIT(10))
#define SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0_M  (SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0_V << SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0_S)
#define SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0_V  0x00000001U
#define SPI_MEM_S_NAND_FLASH_REQ_OR_CFG0_S  10
/** SPI_MEM_S_NAND_FLASH_CMD_INDEX0 : HRO; bitpos: [14:11]; default: 0;
 *  MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in
 *  CMD LUT.(Note these registers are described to indicate the
 *  SPI_MEM_S_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
 *  by the user, but cannot exceed 16 )
 */
#define SPI_MEM_S_NAND_FLASH_CMD_INDEX0    0x0000000FU
#define SPI_MEM_S_NAND_FLASH_CMD_INDEX0_M  (SPI_MEM_S_NAND_FLASH_CMD_INDEX0_V << SPI_MEM_S_NAND_FLASH_CMD_INDEX0_S)
#define SPI_MEM_S_NAND_FLASH_CMD_INDEX0_V  0x0000000FU
#define SPI_MEM_S_NAND_FLASH_CMD_INDEX0_S  11

/** SPI_MEM_S_XTS_PLAIN_BASE_REG register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
#define SPI_MEM_S_XTS_PLAIN_BASE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x300)
/** SPI_XTS_PLAIN : R/W; bitpos: [31:0]; default: 0;
 *  This field is only used to generate include file in c case. This field is useless.
 *  Please do not use this field.
 */
#define SPI_XTS_PLAIN    0xFFFFFFFFU
#define SPI_XTS_PLAIN_M  (SPI_XTS_PLAIN_V << SPI_XTS_PLAIN_S)
#define SPI_XTS_PLAIN_V  0xFFFFFFFFU
#define SPI_XTS_PLAIN_S  0

/** SPI_MEM_S_XTS_LINESIZE_REG register
 *  Manual Encryption Line-Size register
 */
#define SPI_MEM_S_XTS_LINESIZE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x340)
/** SPI_XTS_LINESIZE : R/W; bitpos: [1:0]; default: 0;
 *  This bits stores the line-size parameter which will be used in manual encryption
 *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
 *  32-bytes, 2: 64-bytes, 3:reserved.
 */
#define SPI_XTS_LINESIZE    0x00000003U
#define SPI_XTS_LINESIZE_M  (SPI_XTS_LINESIZE_V << SPI_XTS_LINESIZE_S)
#define SPI_XTS_LINESIZE_V  0x00000003U
#define SPI_XTS_LINESIZE_S  0

/** SPI_MEM_S_XTS_DESTINATION_REG register
 *  Manual Encryption destination register
 */
#define SPI_MEM_S_XTS_DESTINATION_REG (DR_REG_PSRAM_MSPI0_BASE + 0x344)
/** SPI_XTS_DESTINATION : R/W; bitpos: [0]; default: 0;
 *  This bit stores the destination parameter which will be used in manual encryption
 *  calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.
 */
#define SPI_XTS_DESTINATION    (BIT(0))
#define SPI_XTS_DESTINATION_M  (SPI_XTS_DESTINATION_V << SPI_XTS_DESTINATION_S)
#define SPI_XTS_DESTINATION_V  0x00000001U
#define SPI_XTS_DESTINATION_S  0

/** SPI_MEM_S_XTS_PHYSICAL_ADDRESS_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_PHYSICAL_ADDRESS_REG (DR_REG_PSRAM_MSPI0_BASE + 0x348)
/** SPI_XTS_PHYSICAL_ADDRESS : R/W; bitpos: [29:0]; default: 0;
 *  This bits stores the physical-address parameter which will be used in manual
 *  encryption calculation. This value should aligned with byte number decided by
 *  line-size parameter.
 */
#define SPI_XTS_PHYSICAL_ADDRESS    0x3FFFFFFFU
#define SPI_XTS_PHYSICAL_ADDRESS_M  (SPI_XTS_PHYSICAL_ADDRESS_V << SPI_XTS_PHYSICAL_ADDRESS_S)
#define SPI_XTS_PHYSICAL_ADDRESS_V  0x3FFFFFFFU
#define SPI_XTS_PHYSICAL_ADDRESS_S  0

/** SPI_MEM_S_XTS_TRIGGER_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_TRIGGER_REG (DR_REG_PSRAM_MSPI0_BASE + 0x34c)
/** SPI_XTS_TRIGGER : WT; bitpos: [0]; default: 0;
 *  Set this bit to trigger the process of manual encryption calculation. This action
 *  should only be asserted when manual encryption status is 0. After this action,
 *  manual encryption status becomes 1. After calculation is done, manual encryption
 *  status becomes 2.
 */
#define SPI_XTS_TRIGGER    (BIT(0))
#define SPI_XTS_TRIGGER_M  (SPI_XTS_TRIGGER_V << SPI_XTS_TRIGGER_S)
#define SPI_XTS_TRIGGER_V  0x00000001U
#define SPI_XTS_TRIGGER_S  0

/** SPI_MEM_S_XTS_RELEASE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_RELEASE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x350)
/** SPI_XTS_RELEASE : WT; bitpos: [0]; default: 0;
 *  Set this bit to release encrypted result to mspi. This action should only be
 *  asserted when manual encryption status is 2. After this action, manual encryption
 *  status will become 3.
 */
#define SPI_XTS_RELEASE    (BIT(0))
#define SPI_XTS_RELEASE_M  (SPI_XTS_RELEASE_V << SPI_XTS_RELEASE_S)
#define SPI_XTS_RELEASE_V  0x00000001U
#define SPI_XTS_RELEASE_S  0

/** SPI_MEM_S_XTS_DESTROY_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_DESTROY_REG (DR_REG_PSRAM_MSPI0_BASE + 0x354)
/** SPI_XTS_DESTROY : WT; bitpos: [0]; default: 0;
 *  Set this bit to destroy encrypted result. This action should be asserted only when
 *  manual encryption status is 3. After this action, manual encryption status will
 *  become 0.
 */
#define SPI_XTS_DESTROY    (BIT(0))
#define SPI_XTS_DESTROY_M  (SPI_XTS_DESTROY_V << SPI_XTS_DESTROY_S)
#define SPI_XTS_DESTROY_V  0x00000001U
#define SPI_XTS_DESTROY_S  0

/** SPI_MEM_S_XTS_STATE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_STATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x358)
/** SPI_XTS_STATE : RO; bitpos: [1:0]; default: 0;
 *  This bits stores the status of manual encryption. 0: idle, 1: busy of encryption
 *  calculation, 2: encryption calculation is done but the encrypted result is
 *  invisible to mspi, 3: the encrypted result is visible to mspi.
 */
#define SPI_XTS_STATE    0x00000003U
#define SPI_XTS_STATE_M  (SPI_XTS_STATE_V << SPI_XTS_STATE_S)
#define SPI_XTS_STATE_V  0x00000003U
#define SPI_XTS_STATE_S  0

/** SPI_MEM_S_XTS_DATE_REG register
 *  Manual Encryption version register
 */
#define SPI_MEM_S_XTS_DATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x35c)
/** SPI_XTS_DATE : R/W; bitpos: [29:0]; default: 539035911;
 *  This bits stores the last modified-time of manual encryption feature.
 */
#define SPI_XTS_DATE    0x3FFFFFFFU
#define SPI_XTS_DATE_M  (SPI_XTS_DATE_V << SPI_XTS_DATE_S)
#define SPI_XTS_DATE_V  0x3FFFFFFFU
#define SPI_XTS_DATE_S  0

