espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_reg.h
/** SPI_MEM_S_REGISTERRND_ECO_HIGH_REG register
 *  MSPI ECO high register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_S_REGISTERRND_ECO_HIGH_REG (DR_REG_PSRAM_MSPI0_BASE + 0x3f0)
/** SPI_MEM_S_REGISTERRND_ECO_HIGH : R/W; bitpos: [31:0]; default: 892;
 *  ECO high register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_REGISTERRND_ECO_HIGH    0xFFFFFFFFU
#define SPI_MEM_S_REGISTERRND_ECO_HIGH_M  (SPI_MEM_S_REGISTERRND_ECO_HIGH_V << SPI_MEM_S_REGISTERRND_ECO_HIGH_S)
#define SPI_MEM_S_REGISTERRND_ECO_HIGH_V  0xFFFFFFFFU
#define SPI_MEM_S_REGISTERRND_ECO_HIGH_S  0

/** SPI_MEM_S_REGISTERRND_ECO_LOW_REG register
 *  MSPI ECO low register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_S_REGISTERRND_ECO_LOW_REG (DR_REG_PSRAM_MSPI0_BASE + 0x3f4)
/** SPI_MEM_S_REGISTERRND_ECO_LOW : R/W; bitpos: [31:0]; default: 892;
 *  ECO low register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_REGISTERRND_ECO_LOW    0xFFFFFFFFU
#define SPI_MEM_S_REGISTERRND_ECO_LOW_M  (SPI_MEM_S_REGISTERRND_ECO_LOW_V << SPI_MEM_S_REGISTERRND_ECO_LOW_S)
#define SPI_MEM_S_REGISTERRND_ECO_LOW_V  0xFFFFFFFFU
#define SPI_MEM_S_REGISTERRND_ECO_LOW_S  0

/** SPI_MEM_S_DATE_REG register
 *  SPI0 version control register
 */
#define SPI_MEM_S_DATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x3fc)
/** SPI_MEM_S_DATE : R/W; bitpos: [27:0]; default: 38834224;
 *  SPI0 register version.
 */
#define SPI_MEM_S_DATE    0x0FFFFFFFU
#define SPI_MEM_S_DATE_M  (SPI_MEM_S_DATE_V << SPI_MEM_S_DATE_S)
#define SPI_MEM_S_DATE_V  0x0FFFFFFFU
#define SPI_MEM_S_DATE_S  0

#ifdef __cplusplus
}
#endif
